{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_data", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 1], [4, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv0_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 1], [11, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit1_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 1], [19, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit1_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_sc_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_sc", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[13, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2560", 
      "inputs": [[23, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit2_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 1], [30, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit2_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit2_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit2_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 1], [38, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit2_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit2_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2561", 
      "inputs": [[42, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit3_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 1], [47, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit3_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit3_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit3_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 1], [55, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit3_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit3_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2562", 
      "inputs": [[59, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 1], [64, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit1_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 1], [72, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit1_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_sc_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_sc", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[66, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2563", 
      "inputs": [[76, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit2_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0], [81, 0, 0], [82, 0, 1], [83, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit2_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit2_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit2_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 1], [91, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit2_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit2_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2564", 
      "inputs": [[95, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit3_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 0], [98, 0, 0], [99, 0, 1], [100, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit3_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit3_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit3_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0], [107, 0, 1], [108, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit3_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit3_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2565", 
      "inputs": [[112, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit4_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0], [116, 0, 1], [117, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit4_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit4_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[119, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit4_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[121, 0, 0], [122, 0, 0], [123, 0, 0], [124, 0, 1], [125, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit4_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit4_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[127, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2566", 
      "inputs": [[129, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit1_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[130, 0, 0], [131, 0, 0], [132, 0, 0], [133, 0, 1], [134, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit1_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[136, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit1_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[138, 0, 0], [139, 0, 0], [140, 0, 0], [141, 0, 1], [142, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit1_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[144, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_sc_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_sc", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[136, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2567", 
      "inputs": [[146, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit2_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[149, 0, 0], [150, 0, 0], [151, 0, 0], [152, 0, 1], [153, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit2_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit2_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit2_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[157, 0, 0], [158, 0, 0], [159, 0, 0], [160, 0, 1], [161, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit2_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit2_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[163, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2568", 
      "inputs": [[165, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit3_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[166, 0, 0], [167, 0, 0], [168, 0, 0], [169, 0, 1], [170, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit3_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit3_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[172, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit3_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[174, 0, 0], [175, 0, 0], [176, 0, 0], [177, 0, 1], [178, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit3_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[179, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit3_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[180, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2569", 
      "inputs": [[182, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit4_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[183, 0, 0], [184, 0, 0], [185, 0, 0], [186, 0, 1], [187, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit4_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit4_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[189, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit4_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[191, 0, 0], [192, 0, 0], [193, 0, 0], [194, 0, 1], [195, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit4_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit4_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[197, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2570", 
      "inputs": [[199, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit5_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[200, 0, 0], [201, 0, 0], [202, 0, 0], [203, 0, 1], [204, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit5_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[205, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit5_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[206, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit5_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[208, 0, 0], [209, 0, 0], [210, 0, 0], [211, 0, 1], [212, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit5_relu2", 
      "attr": {"act_type": "relu"}, 
